<a href="https://colab.research.google.com/github/ANGELA-NYUTU/DSC10-moringa-school-prep/blob/main/Data_Investigation_with_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<font color="green">*To start working on this notebook, or any other notebook that we will use in the Moringa Data Science Course, we will need to save our own copy of it. We can do this by clicking File > Save a Copy in Drive. We will then be able to make edits to our own copy of this notebook.*</font>

# Data Investigation with Pandas

## 1.0 Importing our Libraries

In [ ]:
# Importing the libraries we will need 

# Importing the pandas library
# 
import pandas as pd

# Importing the numpy library
#
import numpy as np

## 1.1 Reading the Dataset from our CSV file



The dataset we will use contains information about the 2009 Census - The Rural Urban Population by Age, Sex and District.


*   Dataset link for download or access: [Link](https://drive.google.com/open?id=1pc9ZLFGsosdWBk1lI29ADIqRtCvD_FBe)

In [ ]:
# Let's read the data from the CSV file and create the dataframe to be used
# 
url = '/content/Rural_Urban_Population_By_Age_Sex_and_by_District__2009.csv'
df = pd.read_csv(url)
df

           District Urban/Rural Age_years  ...   County  Province  OBJECTID
0      NAIROBI WEST       Urban         0  ...  Nairobi   NAIROBI         0
1      NAIROBI WEST       Urban         1  ...  Nairobi   NAIROBI         1
2      NAIROBI WEST       Urban         2  ...  Nairobi   NAIROBI         2
3      NAIROBI WEST       Urban         3  ...  Nairobi   NAIROBI         3
4      NAIROBI WEST       Urban         4  ...  Nairobi   NAIROBI         4
...             ...         ...       ...  ...      ...       ...       ...
25415    TESO SOUTH       Rural        77  ...    Busia   WESTERN     25415
25416    TESO SOUTH       Rural        78  ...    Busia   WESTERN     25416
25417    TESO SOUTH       Rural        79  ...    Busia   WESTERN     25417
25418    TESO SOUTH       Rural       80+  ...    Busia   WESTERN     25418
25419    TESO SOUTH       Rural    Age NS  ...    Busia   WESTERN     25419

[25420 rows x 9 columns]

## 1.2 Previewing our Dataset

In [ ]:
# Let's preview the first 10 rows of our data
# 
df.head(10)

       District Urban/Rural Age_years   Male  ...  Total   County Province OBJECTID
0  NAIROBI WEST       Urban         0  10126  ...  20242  Nairobi  NAIROBI        0
1  NAIROBI WEST       Urban         1   8124  ...  16113  Nairobi  NAIROBI        1
2  NAIROBI WEST       Urban         2   8462  ...  17089  Nairobi  NAIROBI        2
3  NAIROBI WEST       Urban         3   8334  ...  16754  Nairobi  NAIROBI        3
4  NAIROBI WEST       Urban         4   7948  ...  15768  Nairobi  NAIROBI        4
5  NAIROBI WEST       Urban         5   7547  ...  15207  Nairobi  NAIROBI        5
6  NAIROBI WEST       Urban         6   6966  ...  14048  Nairobi  NAIROBI        6
7  NAIROBI WEST       Urban         7   6511  ...  13185  Nairobi  NAIROBI        7
8  NAIROBI WEST       Urban         8   6171  ...  12660  Nairobi  NAIROBI        8
9  NAIROBI WEST       Urban         9   6361  ...  13023  Nairobi  NAIROBI        9

[10 rows x 9 columns]

## 1.3 Accessing Information about our Dataset

In [ ]:
# We can getting to know more about the dataset by accessing its information 
#

## 1.4 Answering Questions

Let's answer the following questions with our dataset

In [ ]:
# Challenge 1
# What was the average age of a person of Kenya?
from sklearn.preprocessing import LabelEncoder
label_encoder = LabelEncoder()
label_encoder.fit(df['Age_years'])
df['Age_years'] = label_encoder.transform(df['Age_years'])
df['Age_years'].mean()

40.5

In [ ]:
# Challenge 2
# What was the average female population in Kenya?
#
df['Female'].mean()

763.8725019669552

In [ ]:
# Challenge 3
# What was the average male population in Kenya?
#
df['Male'].mean()

755.0140833988985

In [ ]:
# Challenge 4
# Which 5 districts were the most densely populated Kenya in descending order?
df1 =df.groupby(['District']).sum().sort_values('Total', ascending = False)
df1.head(5)

               Age_years    Male  Female    Total  OBJECTID
District
NAIROBI EAST        3321  582554  561862  1144416     10045
NAIROBI NORTH       3321  545701  516385  1062086     16769
NAIROBI WEST        3321  352227  332538   684765      3321
SIAYA               6642  257711  292513   550224   2009943
MOLO                6642  271954  270149   542103   2723138

In [ ]:
# Challenge 5
# Which 5 counties were the most densely populated Counties in descending order?
df2 = df.groupby (['County']).sum().sort_values('Total', ascending= False)
df2.head(5)

          Age_years     Male   Female    Total  OBJECTID
County
Nairobi       13284  1605230  1533139  3138369     53628
Kiambu        59778   827800   845985  1673785  11208021
Kakamega      46494   800989   859662  1660651  20554694
Nakuru        26568   804582   798743  1603325  10811864
Meru          46494   786220   805313  1591533  11248678

In [ ]:
# Challenge 6
# Which 5 districts were the most sparsely populated in descending order?
# 
dfdist = df.groupby(['District']).sum().sort_values('Total', ascending= True,)
dfdist.head(5)

                Age_years   Male  Female  Total  OBJECTID
District
LAIKIPIA NORTH       6642  16928   15834  32762   2642450
GARBATULLA           6642  23314   19804  43118   1553162
MARSABIT             6642  23305   23197  46502   1485922
SAMBURU EAST         6642  29011   30083  59094   2386938
SAMBURU NORTH        6642  31471   28330  59801   2400386

In [ ]:
# Challenge 7
# What was the average population of the the most densely populated county in Kenya?
# 
df3 = df[df['County'] == 'Nairobi']
df3.groupby(['County']).mean()

         Age_years         Male       Female        Total  OBJECTID
County
Nairobi       40.5  4893.993902  4674.204268  9568.198171     163.5

In [ ]:
# Challenge 8
# What was the average population of the the most sparsely populated county in Kenya?
# 
df_county = df.groupby(['County']).sum().sort_values('Total', ascending= True,)
df_county.head(5)
df_county1 = df[df['County'] == 'Lamu']
df_county1.groupby(['County']).mean()

        Age_years        Male      Female       Total  OBJECTID
County
Lamu         40.5  323.445122  295.695122  619.140244    8814.5

In [ ]:
# Challenge 9
# What was the total population of Busia County? 
# 
pop_Busia = df[df["County"] == "Busia"]
pop_Busia.groupby(["County"])['Total'].sum()

County
Busia    743946
Name: Total, dtype: int64

In [ ]:
# Challenge 10
# What was the average age of person in Busia County? How many people of this age were in Busia County?
# 
pop_Busia = df[df['County'] == 'Busia']
pop_Busia.groupby(['County'])['Age_years'].mean()

County
Busia    40.5
Name: Age_years, dtype: float64

In [ ]:
# Challenge 11
# What was the Total population of Teso South District?
# 
pop_Teso =df[df['District'] =='TESO SOUTH']
pop_Teso.groupby(['District'])['Total'].sum()

District
TESO SOUTH    137924
Name: Total, dtype: int64

In [ ]:
# Challenge 12
# What was the urban population of Teso South District?
# 
upop_Teso1 =df[(df['District'] =='TESO SOUTH') & (df['Urban/Rural'] == 'Urban')]
upop_Teso1['Total'].sum()

26162

In [ ]:
# Challenge 13
# What was the rural population of Teso South District?
# 
rpop_Teso = df[(df['District'] == 'TESO SOUTH') & (df['Urban/Rural'] == 'Rural')]
rpop_Teso['Total'].sum()

111762

In [ ]:
# Challenge 14
# What was the population of people aged 60 and above in Kenya?
#
popu_age = df[df["Age_years"] >= 60]
popu_age["Total"].sum()

4770344

In [ ]:
# Challenge 15 
# What was the urban population in Kenya?
pop_urban = df[df["Urban/Rural"] == "Urban"]
pop_urban.groupby(["Urban/Rural"])['Total'].sum()

Urban/Rural
Urban    12487375
Name: Total, dtype: int64